; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
(define (problem transport-27)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 - vehicle
    p1 p2 p3 p4 p5 - package
    l1 l2 l3 l4 l5 l6 l7 l8 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c2)
    (capacity v2 c1)
    (capacity v3 c1)
    (capacity v4 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l8)
    (at p2 l5)
    (at p3 l6)
    (at p4 l8)
    (at p5 l6)
    (at v1 l3)
    (at v2 l2)
    (at v3 l1)
    (at v4 l8)
    (road l8 l4)
    (road l7 l1)
    (road l5 l8)
    (road l1 l5)
    (road l6 l8)
    (road l5 l1)
    (road l1 l7)
    (road l4 l8)
    (road l8 l6)
    (road l5 l3)
    (road l2 l5)
    (road l8 l5)
    (road l3 l5)
    (road l5 l2)
    (road l1 l4)
    (road l4 l1)
    (road l4 l7)
    (road l7 l4)
    (road l2 l8)
    (road l8 l2)
    (road l2 l7)
    (road l7 l2)
    (road l2 l3)
    (road l3 l2)
    (road l1 l6)
    (road l6 l1)
    (road l3 l4)
    (road l4 l3)
    (road l4 l5)
    (road l5 l4)
    (road l4 l6)
    (road l6 l4)
    (road l2 l4)
    (road l4 l2)
    (road l2 l6)
    (road l6 l2)
    (road l5 l7)
    (road l7 l5)
    (road l1 l3)
    (road l3 l1)
    (road l3 l8)
    (road l8 l3)
    (road l3 l7)
    (road l7 l3)
    (road l6 l7)
    (road l7 l6)
    )
 (:goal (and 
(at p1 l5)
(at p2 l7)
))
)

; plan
1. (pick-up v4 l8 p1 c1 c2)
   deleted: (at p1 l8) (capacity v4 c2)
   added: (in p1 v4) (capacity v4 c1)
   goals met: 0 of 2
2. (drive v4 l8 l5)
   deleted: (at v4 l8)
   added: (at v4 l5)
   goals met: 0 of 2
3. (drop v4 l5 p1 c1 c2)
   deleted: (in p1 v4) (capacity v4 c1)
   added: (at p1 l5) (capacity v4 c2)
   goals met: 1 of 2
4. (pick-up v4 l5 p2 c1 c2)
   deleted: (at p2 l5) (capacity v4 c2)
   added: (in p2 v4) (capacity v4 c1)
   goals met: 1 of 2
5. (drive v4 l5 l7)
   deleted: (at v4 l5)
   added: (at v4 l7)
   goals met: 1 of 2
6. (drop v4 l7 p2 c1 c2)
   deleted: (in p2 v4) (capacity v4 c1)
   added: (at p2 l7) (capacity v4 c2)
   goals met: 2 of 2
